=======================================
Command substitution used as simple arg $(
=======================================

?e $(p8 10)

---

(statements
  (arged_stmt command: (cmd_identifier)
    args: (args
            (arg (cmd_substitution_arg
	      (arged_stmt command: (cmd_identifier)
	        args: (args (arg (arg_identifier)))))))))

=======================================
Command substitution with multiple statements
=======================================

?e $(p8 10; p8 4 @ 0xdeadbeef)

---

(statements
  (arged_stmt command: (cmd_identifier)
    args: (args
            (arg (cmd_substitution_arg
	      (arged_stmt command: (cmd_identifier)
	        args: (args (arg (arg_identifier))))
	      (tmp_seek_stmt
	        (arged_stmt command: (cmd_identifier)
	          args: (args (arg (arg_identifier))))
		(args (arg (arg_identifier)))))))))



=======================================
Command substitution used as simple arg `
=======================================

?e `p8 10`

---

(statements
  (arged_stmt command: (cmd_identifier)
    args: (args
            (arg (cmd_substitution_arg
	      (arged_stmt command: (cmd_identifier)
	        args: (args (arg (arg_identifier)))))))))


=======================================
Nested command substitution
=======================================

?e $(p8 $(?e 10))

---

(statements
  (arged_stmt command: (cmd_identifier)
    args: (args (arg (cmd_substitution_arg
	         (arged_stmt command: (cmd_identifier)
	           args: (args (arg (cmd_substitution_arg
		           (arged_stmt command: (cmd_identifier)
			     args: (args (arg (arg_identifier)))))))))))))


=======================================
Nested command substitution 2
=======================================

?e Hello$(?e Wor$(?e ld))

---

(statements
  (arged_stmt (cmd_identifier)
    (args (arg (concatenation
                 (arg_identifier)
                 (cmd_substitution_arg
                   (arged_stmt (cmd_identifier)
                     (args (arg (concatenation
		                  (arg_identifier)
				  (cmd_substitution_arg
				    (arged_stmt (cmd_identifier)
				      (args (arg (arg_identifier)))))))))))))))
