===============================================================================
Integer Number
===============================================================================

4

-------------------------------------------------------------------------------

(expression 
  (number
     (number_value)))


===============================================================================
Floating Number
===============================================================================

4.0

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)))


===============================================================================
Binary Number
===============================================================================

0b0001110101010101010101010100111111000

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)))


===============================================================================
Ternary Number
===============================================================================

0t0012120012

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)))


===============================================================================
Octal Number
===============================================================================

0o1234345652323421

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)))


===============================================================================
Hexadecimal Number
===============================================================================

0xABBCC00FF

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)))

===============================================================================
Scientific Number Format
===============================================================================

1.23E+10

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)))


===============================================================================
Number Suffix
===============================================================================

23423423424ULL

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)
	(number_suffix)))


===============================================================================
Number Unit
===============================================================================

0x1023MiB

-------------------------------------------------------------------------------

(expression 
  (number
    (number_value)
	(number_unit)))


===============================================================================
Function
===============================================================================

func(arg1, arg2, arg3)

-------------------------------------------------------------------------------

(expression
  (function
     (function_name)
        (argument_list
          (argument_name)
          (argument_name)
          (argument_name))))


===============================================================================
Variable
===============================================================================

x

-------------------------------------------------------------------------------

(expression (variable))


===============================================================================
Unicode Variable
===============================================================================

Âµs

-------------------------------------------------------------------------------

(expression (variable))

===============================================================================
Variable with dots (Flags)
===============================================================================

y + sym.func.1000055d4

-------------------------------------------------------------------------------

(expression
  (sum
    (variable)
	(variable)))

===============================================================================
Assignment
===============================================================================

x = y + 4.0

-------------------------------------------------------------------------------

(expression
 (assignment
  left: (variable)
  right: (sum
    left: (variable)
    right: (number
	  (number_value)))))


===============================================================================
Let binding
===============================================================================

let x = y + 4.0

-------------------------------------------------------------------------------

(expression
 (let_assignment
  left: (variable)
  right: (sum
    left: (variable)
    right: (number
	  (number_value)))))

===============================================================================
Variable Increment
===============================================================================

++x

-------------------------------------------------------------------------------

(expression
  (increment
    (variable)))


===============================================================================
Variable Decrement
===============================================================================

--x

-------------------------------------------------------------------------------

(expression
  (decrement
    (variable)))


===============================================================================
Addition
===============================================================================

x + 4.0

-------------------------------------------------------------------------------

(expression
 (sum
  left: (variable)
  right: (number
    (number_value))))

===============================================================================
Multiple Additions
===============================================================================

x + 4.0 + y

-------------------------------------------------------------------------------

(expression
 (sum
  left: (sum
   left: (variable)
   right: (number
     (number_value)))
  right: (variable)))

===============================================================================
Subtraction
===============================================================================

4 - x

-------------------------------------------------------------------------------

(expression
 (subtraction
  left: (number
    (number_value))
  right: (variable)))

===============================================================================
Multiple subtraction
===============================================================================

4 - x - 3 + 7

-------------------------------------------------------------------------------

(expression
 (sum
  left: (subtraction
   left: (subtraction
    left: (number
	  (number_value))
    right: (variable))
   right: (number
     (number_value)))
  right: (number
    (number_value))))

===============================================================================
Multiplication
===============================================================================

x * 4.0

-------------------------------------------------------------------------------

(expression
 (product
  left: (variable)
  right: (number
    (number_value))))

===============================================================================
Multiple Multiplications
===============================================================================

x * 4.0 * y

-------------------------------------------------------------------------------

(expression
 (product
  left: (product
   left: (variable)
   right: (number
     (number_value)))
  right: (variable)))

===============================================================================
Multiplication & addition
===============================================================================

x * y + z

-------------------------------------------------------------------------------

(expression
 (sum
  left: (product
   left: (variable)
   right: (variable))
  right: (variable)))

===============================================================================
Multiplication & addition backwards
===============================================================================

z + x * y

-------------------------------------------------------------------------------

(expression
 (sum
  left: (variable)
  right: (product
    left: (variable)
    right: (variable))))

===============================================================================
Division
===============================================================================

4 / x

-------------------------------------------------------------------------------

(expression
 (division
  left: (number
    (number_value))
  right: (variable)))

===============================================================================
Multiple division
===============================================================================

x / 4.0 / y * 6

-------------------------------------------------------------------------------

(expression
 (product
  left: (division
   left: (division
    left: (variable)
    right: (number
	  (number_value)))
   right: (variable))
  right: (number
    (number_value))))


===============================================================================
Modulo - "mod" syntax
===============================================================================

14 mod x

-------------------------------------------------------------------------------

(expression
 (modulo
  left: (number
    (number_value))
  right: (variable)))


===============================================================================
Modulo - "%" syntax
===============================================================================

14 % x

-------------------------------------------------------------------------------

(expression
 (modulo
  left: (number
    (number_value))
  right: (variable)))


===============================================================================
Exponents
===============================================================================

x ** y

-------------------------------------------------------------------------------

(expression
 (exponent
  base: (variable)
  exponent: (variable)))

===============================================================================
Exponents of exponents
===============================================================================

x ** 4 ** z

-------------------------------------------------------------------------------

(expression
 (exponent
  base: (exponent
   base: (variable)
   exponent: (number
     (number_value)))
  exponent: (variable)))

===============================================================================
Multiplication, addition, & exponents
===============================================================================

x * y ** 4 + z

-------------------------------------------------------------------------------

(expression
 (sum
  left: (product
   left: (variable)
   right: (exponent
    base: (variable)
    exponent: (number
	  (number_value))))
  right: (variable)))

===============================================================================
Logarithm
===============================================================================

x log y

-------------------------------------------------------------------------------

(expression
 (logarithm
  base: (variable)
  exponent: (variable)))


===============================================================================
Logical NEG
===============================================================================

~x

-------------------------------------------------------------------------------

(expression
 (logical_negation
  right: (variable)))

===============================================================================
Logical AND
===============================================================================

x & y

-------------------------------------------------------------------------------

(expression
 (logical_and
  left: (variable)
  right: (variable)))

===============================================================================
Logical OR
===============================================================================

x | y

-------------------------------------------------------------------------------

(expression
 (logical_or
  left: (variable)
  right: (variable)))

===============================================================================
Logical XOR
===============================================================================

x ^ y

-------------------------------------------------------------------------------

(expression
 (logical_xor
  left: (variable)
  right: (variable)))

===============================================================================
Logical SHL
===============================================================================

x << y

-------------------------------------------------------------------------------

(expression
 (logical_shl
  left: (variable)
  right: (variable)))

===============================================================================
Logical SHR
===============================================================================

x >> y

-------------------------------------------------------------------------------

(expression
 (logical_shr
  left: (variable)
  right: (variable)))

===============================================================================
Logical ROL
===============================================================================

x <<< y

-------------------------------------------------------------------------------

(expression
 (logical_rol
  left: (variable)
  right: (variable)))

===============================================================================
Logical ROR
===============================================================================

x >>> y

-------------------------------------------------------------------------------

(expression
 (logical_ror
  left: (variable)
  right: (variable)))


===============================================================================
Parenthesized expression
===============================================================================

(z + x) * y

-------------------------------------------------------------------------------

(expression
 (product
  left: (sum
   left: (variable)
   right: (variable))
  right: (variable)))

===============================================================================
Parenthesized expression with exponents & division
===============================================================================

(z + x) ** ((y / 2) - 1)

-------------------------------------------------------------------------------

(expression
 (exponent
  base: (sum
   left: (variable)
   right: (variable))
  exponent: (subtraction
   left: (division
    left: (variable)
    right: (number
	  (number_value)))
   right: (number
     (number_value)))))

===============================================================================
Multiple operations combined - Unicode
===============================================================================

Ï log ((Î» + 2) ** ((Ï / 2) - 1) + Ï - Îµ + â) - â(â², â)

-------------------------------------------------------------------------------

(expression
  (subtraction
    left: (logarithm
      base: (variable)
      exponent: (sum
        left: (subtraction
          left: (sum
            left: (exponent
              base: (sum
                left: (variable)
                right: (number
				  (number_value)))
              exponent: (subtraction
                left: (division
                  left: (variable)
                  right: (number
				    (number_value)))
                right: (number
				  (number_value))))
            right: (variable))
          right: (variable))
        right: (variable)))
    right: (function
      (function_name)
      (argument_list
        (argument_name)
        (argument_name)))))

